{"නදීක ගුරුගේ": {"name": "නදීක ගුරුගේ", "Genres": [], "summary": "Nadeeka Guruge (Sinhala: නදීක ගුරුගේ) is one of the most influential composers in Sri Lankan music."}, "ම. ස. ෆෙර්ණන්දෝ": {"name": "ම. ස. ෆෙර්ණන්දෝ", "Birth": 1936, "Genres": ["pop", "baila", "rhythm and blues", "country music"], "summary": "Mahagamage Samson Fernando, (Sinhala: එම්. එස්. ප්‍රනාන්දු, 4 March 1936 - 9 April 1994), popularly as M. S. Fernando, was a Sri Lankan singer and musician.[1] He is a major player in the development of Baila music and was widely popular among Sri Lankan audiences commonly referred to as the \"Baila Chakkrawarthi\" (Baila emperor).[2][3]\n"}, "ජ. අ. මිල්ටෝන් පෙරේරා": {"name": "ජ. අ. මිල්ටෝන් පෙරේරා", "Birth": 1938, "Genres": ["pop", "soul", "classical music", "hindustani music"], "summary": "Jayasinghe Arachchige Milton Perera (Sinhala: මිල්ටන් පෙරේරා; 5 May 1938 – 24 October 1991), popularly known as Milton Perera, was a singer, composer and playback singer of Sri Lankan cinema.[1] One of the most respected artists in Sri Lanka, Milton Perera rendered his voice to diverse array of artists as a playback singer for many films in a career spanned for more than three decades. He was the leading playback singer of Sri Lankan cinema during the 1960s and 1970s.[2]\n"}, "රෝහණ වීරසින්ග්හේ": {"name": "රෝහණ වීරසින්ග්හේ", "Birth": 1949, "summary": "DR. Rohana Weerasinghe is a Sri Lankan musician, composer and singer.[1]\n"}, "ව. ද. අමරදේව": {"name": "ව. ද. අමරදේව", "Birth": 1927, "summary": "Sri Lankabhimanya Wannakuwattawaduge Don Albert Perera[4] (Sinhala: වන්නකුවත්තවඩුගේ දොන් ඇල්බට් පෙරේරා; Tamil: டபிள்யூ. டி. அமரதேவா; 5 December 1927 – 3 November 2016), better known by his adopted name Amaradeva, was a prominent Sri Lankan vocalist, violinist and composer. Primarily using traditional instruments like sitars, tablas and harmoniums, Amaradeva incorporated Sinhala folk music with Indian ragas in his work.[5] Many consider Pandit Amaradeva's contribution to the development of Sinhala music as unmatched; hence, he is occasionally cited as the \"Maestro of Sri Lankan Music\" (Sinhala: හෙළයේ මහා ගාන්දර්වයා, romanized: Helayay Maha Gandarvaya).[3][6][7]\n"}}