{
    "e9fea5f0-dd47-4076-a57f-ab427bae9bc8": {
        "name": "නදීක ගුරුගේ", 
        "genres": [], 
        "birth": null, 
        "summary": "නදීක ගුරුගේ යනු ශ්‍රී ලංකා සංගීතයේ වඩාත්ම බලගතු රචනාකරුවෙකි."
    }, 
    "f289e441-8250-467f-b31c-3a0531dfd66e": {
        "name": "එම්. එස්. ප්‍රනාන්දු", 
        "genres": ["pop", "baila", "rhythm and blues", "country music"], 
        "birth": 1936, 
        "summary": "එම්. එස්. ප්‍රනාන්දු ලෙස ජනප්‍රිය වූ මහගමගේජ් සැම්සන් ප්‍රනාන්දු මහතා ශ්‍රී ලාංකික ගායිකාවක් හා සංගීතඥයෙකි. ඔහු බිබිලා සංගීතය සංවර්ධනය කිරීමේ ප්‍රධානතම ක්‍රිඩකයෙකි."
    }, 
    "1a22d357-830a-4457-8c92-ea9e8b03bfd1": {
        "name": "ජේ. ඒ. මිල්ටන් පෙරේරා", 
        "genres": ["pop", "soul", "classical music", "hindustani music"], 
        "birth": 1938, 
        "summary": "මිල්ටන් පෙරේරා ලෙස ජනප්‍රිය වූ ජයසිංහ අරච්චිගේ මිල්ටන් පෙරේරා, ගායිකාවක්, රළු රචනා ගායිකාවක් වූ අතර එය ශ්‍රී ලංකා සිනමාවේ ගායිකාවක් විය. ශ්‍රී ලංකාවේ වඩාත්ම ගෞරවනීය කලාකරුවෙකු වන මිල්ටන් පෙරේරා විසින් දශක තුනකට වැඩි කාලයක් තිස්සේ පැවති වෘත්තියක බොහෝ චිත්රපට සඳහා ක්‍රිඩක ක්‍රිඩිකාවන් රාශියක් විවිධාකාර කලාකරුවන් සඳහා සිය හ voice ට ය. ඔහු 1960 සහ 1970 දශක සමයේදී ශ්‍රී ලංකා සිනමාවේ ප්‍රමුඛ පසුබිම් ගායිකාවක් විය."
    }, 
    "17f3087d-d5ac-45f0-bd81-af88ab3912e5": {
        "name": "රෝහණ වීරසිංහ", 
        "genres": [], 
        "birth": 1949, 
        "summary": "ආචාර්ය. රෝහණ වීරසිංහ ශ්‍රී ලාංකික සංගීතඥයෙක්, රචනාකරුවෙකු සහ ගායකයෙකි."
    }, 
    "3a3148b5-2ea9-4d9f-a371-ee119d2d79f5": {
        "name": "ඩබ්ලිව්. ඩී. අමරදේව", 
        "genres": [], 
        "birth": 1927, 
        "summary": "අමරදේව අමරදේව යන අමරදේව විසින් වඩාත් හොඳින් දන්නා ශ්‍රී ලංකාභිමානව දොන් ඇල්බට් පෙරේරා ද ප්‍රකට ශ්‍රී ලාංකික හ cally යෙකු, වයලීන කරුවෙකු හා නිර්මාපකයෙකු විය. මූලික වශයෙන් සාම්ප්‍රදායික, ටැබ්ලාස් සහ හාර්මෝනියම් වැනි සාම්ප්‍රදායික උපකරණ, අමරදේව ඔහුගේ කෘතිවල ඉන්දියානු රාග සමඟ සිංහල ජන සංගීතය ඇතුළත් කරයි. බොහෝ දෙනෙක් පණ්ඩුකිට් අමරදේවගේ අසමසම ලෙස සිංහල සංගීත සංවර්ධනය කිරීම සඳහා දායකත්වය සලකති. එබැවින් ඔහුව ඉඳහිට 'ශ්‍රී ලාංකික සංගීතයේ මවුස්ට්රෝ' ලෙස දක්වා ඇත. සිංහල ජන සංගීතය විය. එය බොහෝ දුරට තනි තනු නිර්මාණයක් වටා කැරකෙනු ඇතැයි සඳහන් කළ කේන්ද්රීය තනු නිර්මාණය වන පද එකතු කරන පද එකතු කිරීමට තීරණය කළ අතර එය දැන් ගායනයක් වනු ඇත (සාම්ප්‍රදායික ශ්‍රී ලාංකික සංගීතය සඳහා නොපෙනෙන ලෙස) කලින් නොපවතී. එසේ කිරීමෙන් අමරදේව ජන සම්ප්‍රදායට අනුකූලව බාහිර බලපෑම්වලට ඇතුළත් කර ඇති අද්විතීය ලෙස සිංහල සංගීත ශෛලියක් ඇති කළේය. සනත් නන්දසිරි, වික්ටර් රත්නායක, ටී.එම්. ජයරත්න, සුනිල් එදිරිසිංහ සහ ගුණදාස කපුගේ ආදිය වන අමරදේව, ඉන්දියානු පද්මා ශ්‍රී සම්මානය (2002) ඉන්දියානු පද්මා ශ්‍රී සම්මානය (කලා කීර්ති (1986) සහ දේශමෙමනා ය. සම්මානය (1998). 2003 දී ප්‍රංශ රජය ඔහුට කීර්තිමත් ගෞරවය ප්‍රදානය කළේය. ඩෙස්පැඩි ඩෙස් ආර්ට්ස් ඩෙස්ටෙටර්ස්. නීල්සන් මාධ්ය පර්යේෂණ සොයාගැනීම් මගින් සනාථ කළ ජනප්‍රියම කලාකරුවා ලෙස ඔහු තවමත් තවමත් පවතී. ඔහු යුනෙස්කෝ 1967 මැනිලා සම්මන්ත්රණය ඇතුළු බොහෝ සංසදවල දී ශ්‍රී ලංකාව නියෝජනය කර තිබේ. 1991 දී කෙලනියා විශ්ව විද්යාලයේ දාර්ශන වෛද්ය කදෙකුම කපිතාන් කෞසාගේ උපාධිය 1993 දී රුහුනා විශ්ව විද්යාලය සහ පෙරඩෙනියා විශ්ව විද්යාලයේ උපාධිය 1993 සහ 1998 දී, 1972 දී, පණ්ඩිත් අමරදේව මාලදිවයින් ජාතික ගීය (ගෞම්ලි සපායාම්) විසින් මාලදිවයින් රජයේ ඉල්ලීම පරිදි රචනා කළේය. රාජ්ය අවමංගල්ය උත්සවයක් රජය විසින් ප්‍රකාශයට පත් කරන ලදී."
    }, 
    "57be72fe-6354-459f-9b34-50924f844f5e": {
        "name": "සුනිල් එදිරිසිංහ", 
        "genres": [], 
        "birth": 1949, 
        "summary": "පිතිරුම් සුනිල් ජයප්‍රීති එදිරිසිංහ ශ්‍රී ලංකා සම්භාව්ය සංගීතඥයෙකි. ලුයිස්තානයා හි මායා මිරින්ගුවා පියුනු ලොට් 'සඳහා 1983 දී' මායා මිරින්ගුවා පී 1988 දී මේගල තග්ගා හි තුරූලක හුරතාාල් 'සඳහා වන තුරූලක හුරතාාල්' සඳහා වන තුරූලක හුරතාල් 'සඳහා ස්වර්ණ සංන්කා සම්මානය ඔහුට පිරිනමන ලදී. ඔහු 1988 දී සඳකදා පහානාහි 'තුලසා පවිත්ර' සහ 2002 දී පෝරොන්ඩුවෙන් 'පෝරෝන්ඩු' සඳහා ද සරසවියග සම්මානය ද දිනා ගෙන තිබේ."
    },  
    "4eaf9170-db0b-4851-ae17-4b2aad2f5a91": {
        "name": "ෆ්රෙඩී සිල්වා", 
        "genres": [], 
        "birth": 1938, 
        "summary": "හූප් ලියානගේ අතුකෝරලා මොරිස් ෆ්රෙඩී සිල්වා (1938 ඔක්තෝබර් 0660 29 පෙබරවාරි 06) සහ 2002 සිට 2002 දක්වා පෙනී සිටි ශ්‍රී ලංකා සිනමා නළුවෙකු සහ පසුබිම් ගායකයෙකි. ෆ්රෙඩි වඩාත් ජනප්‍රිය ශ්‍රී ලාංකිකයෙකු ලෙස පෙනී සිටියේය 1960 සහ 1980 දශකයේ 1960 සහ 1980 දශකවල විකට නළුවන්. ඔහු චිත්රපට 400 කට අධික සංඛ්යාවක පෙනී සිටි අතර සිංහල සිනමාවේ වසර පනහක් උත්සවයේදී 300 ක් ප්‍රදර්ශනය කෙරිණි."
    }, 
    "d1ad3265-a97f-45d3-a8d5-569de3b4edae": {
        "name": "නිහාල් නෙල්සන්", 
        "genres": ["pop", "soul", "rhythm and blues", "baila"], 
        "birth": 1946, 
        "summary": "නිහාල් නෙල්සන් (උපත 1946 ජනවාරි 9; සිංහල:නිහාල් නෙල්සන්), ශ්‍රී ලාංකික ගායන ශිල්පියෙක්, ගීත රචකයෙක් සහ තනු නිර්මාපකයෙකි.‘ප්‍රසංග වේදිකාවේදී අපරාජිත’ ලෙස සැලකෙන ලංකාවේ ඉතාමත් බලගතු ගායකයෙකු වන අතර, ඇල්බම 113 ක් සමඟ ශ්‍රී ලාංකික කලාකරුවෙකු විසින් වැඩිම වාර්තාගත ඇල්බමයක් සඳහා වූ වාර්‍තාව නෙල්සන් සතු වේ."
    }, 
    "d8eee3be-0ff8-4e1f-9262-8b22248c9e0c": {
        "name": "හෙන්රි කැල්ඩෙරා", 
        "genres": [], 
        "birth": 1937, 
        "summary": "හෙන්රි කැල්ඩෙරා (1937 ඔක්තෝබර් 11 ඔක්තෝබර් 11) ශ්‍රී ලාංකික ගායිකාවක්, ගීත රචකයෙකු සහ සංගීතඥයෙකි."
    }, 
    "a41fe47a-cf5a-496c-bb88-db615f21289c": {
        "name": "මර්සි එදිරිසිංහ", 
        "genres": [], 
        "birth": 1945, 
        "summary": "ඩොනා මේදිනි එදිරිසිංහ (1945 මාර්තු 17 මාර්තු 18) ශ්‍රී ලංකාවේ, සිනමාහල් සහ රූපවාහිනී මෙන්ම ගායකයෙක් ද වූ නිළියකි. බොහෝ විකට රූපවාහිනී වැඩසටහන් සහ ගුවන්විදුලි නාට්යවල ඇයගේ භූමිකාව සඳහා ද ඇය ප්‍රසිද්ධයි. ඇය 1964 දී 'නවාක මාදල 'ගීතයේ තරගය ආරම්භ කළ අතර 1966 දී වේදිකා නිළියක් බවට පත්විය. ඇගේ අතිශය ප්‍රසිද්ධ නාට්යය සංගීතයේ ඉතා සුප්‍රසිද්ධ නාට්යයක් විය. නාට්යයේ හ tra පටියෙන් ලගිනාසන කපුගේ 'ලගිනා තාරවාන් විසින් රචනා කරන ලදී."
    },    
    "c3f16cb8-52a2-4848-bfa1-bbee22a9cd6c": {
        "name": "නාමල් උඩුගම", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1967, 
        "summary": "ප්‍රසන්න නාමල් උඩුගම (1967 ඔක්තෝබර් 21 වන දින උපත) ශ්‍රී ලාංකික ගායකයෙක්, රචනා සහ ගීත රචකයෙකි. ශ්‍රී ලංකාවේ ජනප්‍රියම කලාකරුවන්ගෙන් එක් අයෙකු වන යථාර්ථයේ යුගය පෙන්නුම් කිරීමට පෙර, නූතන ශ්‍රී ලංකා සංගීත ක්ෂේත්රයේ ඔහු සංකේතාත්මක නිරූපකයක් ලෙස සැලකේ. 2014 දී සෞඛ්ය ගැටලු ඔහුගේ ගායන වෘත්තිය මන්දගාමී කිරීමට ඔහු හේතු විය. උඩුගම 2015 මැද භාගයේ සාර්ථක අක්මාව බද්ධ කිරීමෙන් හොඳින් සුවය."
    }, 
    "464accb4-5892-4a26-a06c-4f3d7d251d4a": {
        "name": "භාතිය සහ සන්තුෂ්", 
        "genres": [], 
        "birth": null, 
        "summary": "භාතිය සහ සන්තුෂ්, නොහොත් BNS යනු, කොළඹ 'මේරි ඈන් ඩේවිඩ් වාචික සංගීත පාසල' හි සිටියදී මුණගැසුණු භාතිය ජයකොඩි සහ සන්තුෂ් වීරමන් ගෙන් සමන්විත ශ්‍රී ලාංකික පොප් යුගලයකි. ඔවුන් දෙදෙනාම උපත ලැබුවේ ශ්‍රී ලංකාවේ කොළඹ ය."
    }, 
    "3962f9b0-5bc6-45c0-b8db-466dcfb301eb": {
        "name": "ෆැලෝන් ඇන්ඩ්රියා", 
        "genres": ["pop", "soul", "rock", "classical", "jazz"], 
        "birth": 1995, 
        "summary": "ෆැලෝන් ඇන්ඩ්රියා ජැන්සන් යනු ශ්‍රී ලාංකික ගායකයෙක් සහ රංගන ශිල්පියෙකි. ඇය සංගීතය ආරම්භ කළේ ඩෙරානා ඩ්රීම් ස්ටාර් සමයේ IX හි මාතෘකාව දිනා ගැනීමෙන් පසුවය. ඇය බොහෝ ප්‍රභේදවල විවිධාකාර ගායකයෙකි."
    }, 
    "6a31a580-03b4-4c65-8978-2113afab5f33": {
        "name": "ජේ. පී. චන්ද්රබාබු", 
        "genres": [], 
        "birth": 1927, 
        "summary": "ජෝශප් පනීමැටඩාස් චන්ද්රබාබු රොඩියුෂස් (1927-1974) තිරයේ ඉන්දියානු චිත්රපට හා සිංගර් සයිජ් හි නළුවා, නළුවා, සිංගර් සහ නර්තන ශිල්පිනියකි. මදුරාසි කලාපයට අද්විතීය වූ ඩයල්රාස් බාෂාගේ දරුණුතම වෛද්යවරයකුගේ ප්‍රවීණත්වයක් ද ඔහු සතුව තිබූ අතර පසුව නළු නිළියන් විසින් අනුකරණය වේ. ඔහුගේ බොහෝ ගීත ජනප්‍රිය වී තිබේ."
    }, 
    "4a631a86-6a40-4050-9a1b-f8048cab47eb": {
        "name": "සචිත් පීරිස්", 
        "genres": [], 
        "birth": 1986, 
        "summary": "සචිත් පීරිස් (1986 ඔක්තෝබර් 04 වන දින උපත) යනු ශ්‍රී ලංකාවේ සම්මානලාභී සංගීත අධ්යක්ෂවරයකු, පසුබිම් ගායක සහ වීඩියෝ අධ්යක්ෂකවරයෙකි."
    }, 
    "2d170e9e-5504-44e1-b6e8-be2400f926eb": {
        "name": "ගෞරව් දාගොන්කාර්", 
        "genres": [], 
        "birth": 1982, 
        "summary": "ගවාවාන්කාර් ඉන්දියානු ව්යවසායකයා සහ නිර්මාපශීලී සහ ප්‍රධාන විධායක නිලධාරී (ප්‍රධාන විධායක) ගීත රැවරුවේ ප්‍රධාන විධායක නිලධාරී (ප්‍රධාන විධායක නිලධාරී). ඔහු ජනප්‍රිය සංගීත අධ්යක්ෂවරයකු වන ගීත රචකයෙකු සහ ගායකයෙකු ලෙසද හැඳින්වේ. සංගීත අධ්යක්ෂවරයෙකු ලෙස ගෞරව්ගේ පළමු නිකුතුව 2011 දෙසැම්බර් 9 වන දින නිකුත් කළ චිත්රපටය ලංකා චිත්රපටයයි. ව්යාපාරික විධායක නිලධාරියෙකු ලෙස ගවරා සංගීතය ආරම්භ කළේ ගීත කල් පවතින්නේ ඉන්දියාවේ ප්‍රමුඛතම කලාත්මක ලේබල් ය."
    }, 
    "e6e07e8e-5d1d-4bab-b075-f884553d40a2": {
        "name": "උරේහා රවීහාරි", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1982, 
        "summary": "යූරහා රවීහාරි වික්‍රමසිංහ, (1982 ජුනි 26 දින) ශ්‍රී ලංකා ගීත රශ්මියෙකි. ශ්‍රී ලංකා සිංහල සිනමාවේ ප්‍රමුඛ පෙළේ පසුබිම් ගායකයින්ගෙන් එකක් ලෙස රයිහාරි අඛණ්ඩව වසර තුනකින් හොඳම ගවයාිකාව සඳහා සරසවිය සම්මාන උළෙලේදී පැවැත්වෙන සම්මාන රාශියක් දිනා ගෙන තිබේ."
    }, 
    "70d6461f-bfff-4722-8a4a-156c78c50e73": {
        "name": "ඉරාජ් වීරරත්න", 
        "genres": [], 
        "birth": 1981, 
        "summary": "ඉරාජ් වීරරත්න යනු සිංහල R&B සහ හිප් හොප් කලාකරුවෙකු සහ සංගීත නිෂ්පාදකයෙකි. ඉරාජ් දෙරණ ටීවී එකේ 'ඉරාජ් ෂෝ' කියලා රුපවාහිනී වැඩසටහනක් තිබුණා. ඔහුගේ ප්‍රථම දකුණු ඉන්දියානු රචනා සහ විජේ ඇන්තනි සමඟ කොලිවුඩ්හි විජය රඟපෑ වීට්ටකරන් චිත්‍රපටයේ චෙන්නායි ප්‍රස්ථාරයේ අංක එකේ ස්ථානයට පත්විය."
    }, 
    "1c58987f-fcf9-4be4-b8e7-10ca83b9cbaf": {
        "name": "අනිල් මිහිරිපන්න", 
        "genres": [], 
        "birth": 1933, 
        "summary": "ශතපති අනිල් මිහිරිපිටා (1933 අගෝස්තු 10, 2017 අගෝස්තු 10) එස්රාජ් ඉන්දියානු උණ බම්බු ෆ්ලූට් වාදනය කළ ශ්‍රී ලාංකික සම්භාව්ය සංගීතඥයෙක් වූයේ නළුණ සහ ඊසරාජ් යන දෙකෙහිම උපාධි ලබාගත් පළමු ශ්‍රී ලාංකිකයා ය . ඔහුගේ ශිරා කලා නිකේතනයාව ධාවනය කරමින් ඔහු පසුගිය අවුරුදු හතළිහ තුළ ශ්‍රී ලංකාවේ ඉන්දියානු ශාස්ත්රීය සංගීතය ඉගැන්වීමට, සංවර්ධනය කිරීමට හා ප්‍රචලිත කිරීමට උත්සාහ කළේය."
    }, 
    "92b1e536-d109-4caa-a9b3-168459171c12": {
        "name": "උදය ප්‍රියන්ත කුමරු", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1970, 
        "summary": "උදය ප්‍රියන්ත කුමරු (1970 ජුනි 13 - 2017 ජූනි 13) ශ්‍රී ලාංකික ගායකයෙක්, රචනා සහ ගීත රචකයෙකු විය."
    }, 
    "6b664975-5758-4ef8-9dc7-575f88061475": {
        "name": "තරංගා ගුණතිලක", 
        "genres": ["opera"], 
        "birth": null, 
        "summary": "තරංගා ගුණතිලක යනු ශ්‍රී ලංකාවේ බදුල්ලා හි උපත ලැබූ සෝප්‍රානෝ ඔපෙරා ගායිකාවක් වන නමුත් වැඩුණේ රත්මලනා හි ය. ඇගේ ගායන හැකියාව ශ්‍රී ලංකාවට යන අතරම ලෝකයේ ප්‍රමුඛ පෙළේ සංගීත පාසල්වලින් එකක් වන ජූලකර් පාසලට සහභාගී වූ පළමු කාන්තාව ඇයයි. ඇය ජීවත් වන්නේ නිව්යෝර්ක් නගරයේ සහ ඔපෙරා හි ඇගේ වෘත්තීය ජීවිතය ජාත්යන්තර අවධානය ලැබී තිබේ."
    }, 
    "20cc8d8c-5ae0-4c45-9299-3457aadf55bc": {
        "name": "ඇනස්ලි මාලේවන", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": null, 
        "summary": "ඇනස්ලි මාලේවන ශ්‍රී ලාංකික සංගීතඥයෙකි. බොහෝ විට 'සිංහල පොපන්ගේ කුමාරයා' ලෙස සැලකේ, මාලේවන සමකාලීන බිල් හි ස්වාමියා වූ බීම යනු ජනප්‍රිය සංගීත කණ්ඩායම් සමඟ වැඩ කිරීම ප්‍රසිද්ධයි."
    }, 
    "47d7a29f-e13d-4c1a-b51c-7049c2ac34f4": {
        "name": "ක්ලැරන්ස් විජේවර්ධන", 
        "genres": ["pop", "playback singing", "sri lankan music", "soft rock"], 
        "birth": 1943, 
        "summary": "විතානා කුරුප්පු අරච්චිලේගේ ක්ලැෆ්රන්ග් ආතර් සෝමසිංහ විජේවර්ධන ජේ. පී. 1996 දෙසැම්බර් 13) ශ්‍රී ලාංකික ගායිකාවක්, නිර්මාපකයෙකු සහ සංගීතඥයෙකි. ශ්‍රී ලංකාවේ වඩාත්ම ගෞරවනීය සංගීතඥයෙකු ලෙස සැලකේ විජේවර්ධන 1960 ගණන්වල සිංහල සංගීතයේ විදුලි ගිටාරය භාවිතා කරමින් ශ්‍රී ලංකාවේ සිංහල පොප් සංගීතය විප්ලවීය වෙනසක් කළේය. ඔහු සිංහල පොප් සංගීතය කෙරෙහි ඇති බලපෑම නිසා, ඔහු බොහෝ විට ශ්‍රී ලංකාවේ පොප් සංගීතයේ පියා ලෙස නම් කර ඇත."
    }, 
    "593dc81a-9146-46c3-afdb-e9d2d25a3a21": {
        "name": "අභිෂේක විමලවීර", 
        "genres": ["bhangra", "soft rock"], 
        "birth": 1988, 
        "summary": "සුහසිනි අභිස්ෂෙකා විමලවීර (උපත 198 නොවැම්බර් 11) ශ්‍රී ලාංකික සිංගර්, චිත්රපට පසුබිම් ගායක ගායිකාවක් සහ ගීත රචකයෙකි. උදයකාන්ත වර්ණසූරිය විසිනි."
    }, 
    "d175aeb7-5373-4e03-85d5-207016fae27d": {
        "name": "අජිත් බන්ඩාරා", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": null, 
        "summary": "අජිත් බන්ඩාරා ශ්‍රී ලාංකික ගායකයෙකි. ගායන යථාර්ථය තරඟයේ පළමු කන්නයේ සිරස් සුපර්ස්ටාර් 2006 දී ඔහු රට තුළ ජනප්‍රියයි."
    }, 
    "bb02954d-fb88-456c-9886-45ee66176b84": {
        "name": "ගුණදාස කපුගේ", 
        "genres": ["pop", "soul", "rhythm and blues", "country music"], 
        "birth": 1945, 
        "summary": "එලමුල්ලා කප්ගේ ගුණදාස (1945 අප්‍රියෙල් 7 අප්‍රියෙල් 2003 අප්‍රියෙල් 2003 අප්‍රේල් ඔහුගේ වැඩ සඳහා තෝරාගත් ඔහුගේ සංගීතය විදැහුම්භාවයේ සහ පද රචනා වල දාර්ශනික පසුබිම හේතුවෙන් ඔහු ශ්‍රී ලාංකිකයන් අතර හොඳින් ප්‍රසිද්ධ විය."
    }, 
    "72bed074-eae3-4b66-b7aa-6f0d14daf2b4": {
        "name": "අමරසිරි පීරිස්", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1946, 
        "summary": "සේනාධර් අමරසිරි පීරිස් (1946 ජූලි 21) ශ්‍රී ලාංකික ගායකයෙකි. ශ්‍රී ලංකාවේ වඩාත්ම ගෞරවයෙන් කරන ලද ගායිකාවක් වන පීරිස් ප්‍රසිද්ධ වයලීනතමදියෙකු සහ හ o නාශකයකි."
    }, 
    "de44c907-7325-4f8b-9a6a-d3299976c5c9": {
        "name": "ලහිරු පෙරේරා", 
        "genres": [], 
        "birth": 1984, 
        "summary": "ලහිරු පෙරේරා (1984 අප්‍රියෙල් 18) ද ඔහුගේ අදියර නිගමනය ද හැඳින්වේ. ඔහු උපත ලබා ඇති අතර උඩුගම්පෝලා හි කෙහෙල්බදරා හි රැස් කළේය. ඔවුන්ගේ නවතම ව්යාපාර නවතම ව්යාපාරයක් අතර ලා ෆ්රේට් රේඛාවක් නම් සුවඳ සුවඳ විලවුන් සහ කොලෝන්ස් ඇතුළත් වේ."
    }, 
    "56be607d-2620-479c-aa8f-18bb78133adb": {
        "name": "නීලා වික්‍රමසිංහ", 
        "genres": [], 
        "birth": 1950, 
        "summary": "විශාරද නීලා වික්‍රමසිංහ යනු ප්‍රවීණ කාන්තා ගායිකාවක් සහ ශ්‍රී ලංකාවේ සංගීතඥයෙකි."
    }, 
    "b6e447c1-86ef-4a11-946b-982f07bd7dbe": {
        "name": "ධනිත් ශ්‍රී", 
        "genres": [], 
        "birth": 1994, 
        "summary": "ධනිත් ශ්‍රී (උපත 1994 දෙසැම්බර් 22) ශ්‍රී ලාංකික ගායකයෙක්, රචනා සහ ගීත රචකයෙකි. ඔහු ශ්‍රී ලංකාවේ වඩාත් ජනප්‍රිය කලාකරුවන්ගෙන් කෙනෙකු ලෙස සැලකේ. ධනිති ප්‍රධාන ධාරාවේ සංගීත කර්මාන්තයට ඇතුළු වූයේ 2018 සිය 2018 සිය 2018 'පණ්ඩමා' පහරීය. මෙම ගීතයේ විකල්ප පාෂාණ හැඟීම අනුපූරක වන්නේ ඔහුගේ ඉහළ තන්ත්රයන් සහ ශ්‍රී ලංකාවේ සාම්ප්‍රදායික ඩ්රම් බීට්ස් සහ සංස්තරතීන් විසිනි. එය සහ ඊට සමගාමීව රූපවාහිනී සහ ගුවන්විදුලි ප්‍රචාරක වල අංක එකේ එක් අයෙකු බවට පත්විය."
    }, 
    "321dce92-a24d-4529-a050-a79b1a1453e3": {
        "name": "ප්‍රේමසිරි කෙමදාස", 
        "genres": [], 
        "birth": 1937, 
        "summary": "දේශමමන් කලා කලා කීර්ති ආචාර්ය හෙටසිරි කෙමාදාස (1937 ජනවාරි 25) 'කෙමදාස මාස්ටර්' ලෙසද හැඳින්වේ. ලෝක වටයේ විවිධ සංගීත ශෛලීන් ගවේෂණය කිරීම කෙමදාස අද්විතීය සංගීත ශෛලියක් වර්ධනය කිරීමට උත්සාහ කළේය. ඔහු සමකාලීන සංගීතයට අනුබල දෙන ලෙස සිංහල ජන නාද, හින්දුස්ථානි සංගීතය, බටහිර සංගීතය සහ ඔහුගේ රචනා කරන ලද බටහිර සංගීතය සහ ඔහුගේ රචනාවල තවත් බොහෝ ගංගා ඒකාබද්ධ කළේය."
    }, 
    "adaa203b-376d-46f5-b360-1497550b7018": {
        "name": "එඩ්වඩ් ජයකොඩි", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1952, 
        "summary": "ජයකොඩි අරච්චිගේ දොන් එඩ්වඩ් තිමෝති හෝ එඩ්වඩ් ජයකොඩි ලෙස ජනප්‍රිය වූ එඩ්වඩ් ජයකොඩි, සිංගර් සහ රචනාකරුවෙකි. ජයකොඩි විසින් සිංහල චිත්රපට සිය ගණනක් සහ රූපවාහිනී අනුක්රමික සඳහා සංගීතය මෙහෙයවූ අතර ළමා ක්රමලේඛනය සඳහා ගීත රාශියක් ('කොප්‍රා කොප්පාරා') ද රචනා කර ඇත. ගදරදුන් අම්මා චිත්රපටයේ හොඳම පිරිමි ගායකයා. ඔහු 1979 සහ 1980 දී හොඳම සංගීත අධ්යක්ෂවරයා වූ නාදාන් සහ උපපරෝදනිය සහකා සහා දණ්ඩුවමා යන නාට්ය සඳහා දිනා ගත්තේය."
    }, 
    "a6ca9fe7-2c23-4e3f-be7c-726f99b48c9d": {
        "name": "චන්ද්රසේන හෙට්ටියාරච්චි", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": null, 
        "summary": "හෙට්ටියාරච්චිගේ චන්ද්රසේන (සැප්තැම්බර් 7), චන්ද්රසේන හෙට්ටියාරච්චි ලෙස ජනප්‍රියය. කණ්ඩායම් ගායිකාවක් ලෙස තරුණ ගායනා කණ්ඩායමෙන් හෙට්ටියාරච්චිට පත්වූ හෙට්ටියාරච්චිට තම දක්ෂතා පෙන්වීමට හැකි වූ අතර මෝල් මල් නපුරු ගීත කිහිපයක්, අම්මා ජීවනා, ඔයාකාත් සහ නවාලා අන්නස්සි වැනි ජනප්‍රිය ගීත කිහිපයක් ගායනා කර තිබේ."
    }, 
    "d55c510b-5edf-42d9-98ec-bbbaa363ad41": {
        "name": "මිල්ටන් මල්ලවරාච්චි", 
        "genres": ["pop", "soul", "rhythm and blues", "country music"], 
        "birth": 1944, 
        "summary": "සුමනසිරි මල්ලවරාච්චි ඩොන් (194410 මාර්තු), මිල්ටන් මල්ලවරාච්චි ලෙස ජනප්‍රිය වූ, ශ්‍රී ලාංකික ගායක සහ සංගීතඥයෙකි. ශ්‍රී ලංකාවේ සංගීත ඉතිහාසයේ වඩාත්ම ගෞරවනීය ගායිකාවක් වන මල්ලවරාච්චි දශකයකට වැඩි කාලයක් ශ්‍රී ලංකාවේ ප්‍රවණතා පනතක් වූ අතර, ඇල්බම 35 කට අධික ප්‍රමාණයක් සහිත ගීත 850 කට ආසන්න ප්‍රමාණයක් රැස් කළේය. ඔහු සිය බොහෝ ගීතවල බොහෝ ගීතවල සංගීත රචනා, රිදී වළල්ල, තලන්ත තබ්ලා සහ සිතාර් ප්ලේයරයක් සඳහා චිත්රපට වාදනය කරන සිංගල් වර්ගයක් ලෙසද හැඳින්වේ."
    }, 
    "5101bbb1-a1e6-4305-9ca1-33542b268fe7": {
        "name": "ටී එම්. ජයරත්න", 
        "genres": [], 
        "birth": 1944, 
        "summary": "ටෙනකුන් මුදියන්සලේජ් ජයරත්න මහතා ද ටී.එම්. ජයරත්න (1944 අප්‍රියෙල් 13 දොඩංගොඩ, ශ්‍රී ලංකාව දොඩංගෝඩයේ 1978, 1979 සහ 1987 දී ශ්‍රී ලංකාවේ ජනාධිපති සම්මානය හිමි විය. 2006 දී ජයරත්න මහතා හොඳම පිරිමි සිංගර් සම්මානය හිමි විය රයිගම් ටෙලි සම්මාන උළෙලේදී."
    }, 
    "555370e6-10fe-4f89-97b9-d1a28bb42c67": {
        "name": "ඩෙස්මන්ඩ් ද සිල්වා", 
        "genres": [], 
        "birth": null, 
        "summary": "ඩෙස්මන්ඩ් ද සිල්වා යනු ශ්‍රී ලාංකික ගායිකාවක් හා විනෝදාස්වාදකයෙකු වන අතර, ඔහුගේ තරුණ හ voice ක් දශක හතරක රංගනයන් වෙනස් වී ඇති 'බයිලා රජු' ලෙස සැලකේ. දකුණු ශ්‍රී ලංකාවේ මාතරා හි උපත ලැබූ ද සිල්වා ලොව පුරා ප්‍රසංග ශාලා පැවරීම සඳහා දරා තිබේ."
    }, 
    "5acb0598-8d08-4d00-b60c-cd23831a9711": {
        "name": "R. මුතුසාමි", 
        "genres": [], 
        "birth": null, 
        "summary": "රමයා මුත්තසාමි (1926 ජනවාරි 5 ජනවාරි 5) 1988 ජුනි 27) ශ්‍රී ලංකා සංගීත අධ්යක්ෂවරයකු හා ගායකයා විය. ඔහු බොහොමයක් කේ. කුඩා කල සිටම මුතුසාමි වයලීනය සඳහා හඳුන්වා දෙන අතර වයස අවුරුදු දහය වන විට මෙවලම ප්‍රගුණ කරන ලදී."
    },
    "40fa5f2d-1e0e-4948-9416-c863673c7894": {
        "name": "සුනිල් පෙරේරා", 
        "genres": ["pop", "soul", "rhythm and blues", "baila", "western cha-cha", "rock", "hip hop", "reggae"], 
        "birth": 1952, 
        "summary": "උස්වාත්ත ලියනගේ අයිවෝර් සිල්වෙස්ටර් සුනිල් පෙරේරා (1952 සැප්තැම්බර් 14 සැප්තැම්බර් 14), සුනිල් පෙරේරා, ශ්‍රී ලාංකික හ cir නඟා, ගිටාර්වාදී, ගීත රචකයා සහ නිර්මාපකයෙකු වූ. දිවයිනේ වඩාත් ප්‍රසිද්ධ ගායකයෙකු ලෙස විස්තර කර ඇති, පෙරේරා නායකයා සහ ජිප්සීස් හි ප්‍රධාන ගායනාකරුවා විය. ඔහු ශ්‍රී ලංකාවේ බායික ප්‍රභේදය සමඟ සම්බන්ධ වී 'බයිල්වා චක්රවර්ති' යන අන්වර්ථ නාමය ලබා ගත්තේය."
    }, 
    "ab237def-b34c-49f8-9de1-87aa9457d52b": {
        "name": "කසුන් කල්හාර", 
        "genres": [], 
        "birth": 1981, 
        "summary": "කසුන් කල්හාර ජයවර්ධන (198 නොවැම්බර් 3 වන දින උපත ලැබුවේ කසුන් කල්හාර ලෙස වෘත්තීමය වශයෙන් ප්‍රසිද්ධයි. කසුන් සිය සංගීත දිවිය අතරතුර ඇල්බම තුනක්, හරිත නිම්නායි, රැඩිකල් ප්‍රේමයා සහ ආදර ඔපෙරාව නිකුත් කරන ලදී. ඔහු ශ්‍රී ලංකාවේ විශාලතම හා වඩාත්ම අලෙවි වන සංගීත කලාකරුවන්ගෙන් කෙනෙකි."
    }, 
    "9bff612f-3fc9-4bcb-8267-787597b8c5cb": {
        "name": "සිසිරා සේනරත්න", 
        "genres": ["soul", "indian classical music"], 
        "birth": 1935, 
        "summary": "සිසිරා සේනරත්න (1935 මාර්තු 29) 2015 පෙබරවාරි 2015), ශ්‍රී ලංකා ගායිකාවක් වන අතර ගීත රචකයෙක් සිංහල සිනමාවේ පසුබිම් ගායකයෙකු ලෙස ද කටයුතු කළේය. දශක හයකට වැඩි කාලයක් පුරා දිවා කාලයේ දී සේනරත්න ජනප්‍රිය ගීත කිහිපයක් ගායනා කර ඇත. 1950 දශකයේ සිංහල සංගීතයේ නව යුගයක පැටවීමේදී බිරිඳ ඉන්ද්‍රානි විජේබන්දර සමඟ වැදගත් කාර්යභාරයක් ඉටු කළේය."
    }, 
    "d2d0c731-c9b3-4541-9be7-6792a950b9b8": {
        "name": "ෂිහාන් මිහිරංග බෙනට්", 
        "genres": ["pop", "soul", "rhythm and blues", "jazz", "alternative rock"], 
        "birth": 1985, 
        "summary": "ෂිහාන් මිහිරංග බෙනට් (උපත 1985 මාර්තු 18), ශ්‍රී ලාංකික සංගීතඥයෙකු, රචනා සහ ගීත රචකයෙකු වේ. යථාර්ථවාදී සංදර්ශනවල හොඳම නිෂ්පාදන වලින් එකක් ලෙස මිහිරංග බොහෝ විට ශ්‍රී ලංකාවේ තරුණ තරුණියන්ගේ 'සිහින පිරිමි ළමයා' ලෙස හැඳින්වේ. 1990 දී නාමල් උඩුගමෙන් පසු 2000 ගණන්වල තරුණ සංවේදනය ඔහු බවට පත්විය."
    },
    "ac68f5d8-37f1-4a29-b640-d97882a0618c": {
        "name": "යොලන්ඩ් බවාන්", 
        "genres": [], 
        "birth": 1942, 
        "summary": "යොලන්ඩ් බවාන් (1942 ජුනි 1 වන දින උපත) ශ්‍රී ලාංකික ගායකයෙක් සහ නිළියකි."
    }, 
    "615816b7-802f-461a-ab55-89ddbab9f303": {
        "name": "ඉන්ද්‍රචාප ලියනගේ", 
        "genres": [], 
        "birth": 1981, 
        "summary": "ඉන්ද්‍රචාප ලියනගේ (උපත 1982 ජනවාරි 13 වන දින) ශ්‍රී ලාංකික ගායකයෙකි. ඔහු සිය පළමු ඇල්බමයේ අබින්ෂ්ක්රමනයා (නැවත සකස් කිරීම) සම්පූර්ණ කර ඇති නමුත් එය නිල වශයෙන් තවමත් නිදහස් කර නොමැත."
    }, 
    "5c4bb0af-4645-4bf9-81f0-b672b3d4d1b4": {
        "name": "සුනිල් ශාන්ත", 
        "genres": ["classical", "soul", "rhythm and blues", "sri lankan music"], 
        "birth": 1915, 
        "summary": "Baddaliyanage දොන් ජෝශප් යොහන් (1915 අප්‍රියෙල් 14) 1940 දශකයේ අගභාගයේ සහ 1950 දශකයේ මුල් භාගයේ සිංහල සංගීතය හා ජන ගීත සංවර්ධනය කිරීමේදී ඔහු වැදගත් විය. 1956 සහ 1960 දී ලෙස්ටර් ජේම්ස් පීරිස්ගේ චිත්රපට රෙකවා සහ සන්දේශය සඳහා වූ ආදරණීය හ tra පටිය ඔහු රචනා කළේය. පසුව ඔහු පර්යේෂණාත්මක කෘති කිහිපයක් නිෂ්පාදනය කළේය."
    }, 
    "0013f5a6-e417-4fdd-ac91-fb1b939249e2": {
        "name": "සුජාතා අත්තනායක", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1942, 
        "summary": "කලා සෙරක්රා ආචාර්ය මුදන්ටුටුවා මුනසිංහ අරච්චිගේ සුජාතා පෙරේරා (උපත 1942 මැයි 12), සුජාතා අත්තනායක නම්, ශ්‍රී ලංකාවේ ගීත රංගනය සහ පසුබිම් ගායකයෙකි. ඇය සිංහල සිනමාවේ සහ ශ්‍රී ලංකාවේ සහ ඉන්දියානු දෙමළ සිනමාවේ ප්‍රමුඛ පසුබිම් ගායකයා වන අතර එය ශ්‍රී ලංකාවේ සහ ඉන්දියානු දෙමළ සිනමාවේ ය. සිංහල සංගීතයේ රන් සීනුව ලෙස සැලකේ, දශක හතකට වැඩි කාලයක් පුරා කැසට් 115 කට වැඩි ප්‍රමාණයක් සමඟ ශ්‍රී ලංකාවේ ගීතිකා භටයන් 115 කට වැඩි ප්‍රමාණයක් සමඟ 'ශ්‍රී ලාංකික ගීත රසිකයෙකු 115 කට වැඩි ප්‍රමාණයක් සහිතව ඇය ශ්‍රී ලංකාවේ ගීතිකා භටයින් 115 කට වැඩි ප්‍රමාණයක් සමඟ නිෂ්පාදනය කරන ලද කැසට් වර්ග 115 කට වැඩි ප්‍රමාණයක් සමඟ පටිගත කර ඇති බව ඇය වාර්තා කරයි. ඇය ශ්‍රී ලංකාවේ පළමු කාන්තා සංගීත අධ්යක්ෂවරයා ය. ඇය සිංහල චිත්රපට 400 කට ආසන්න සංඛ්යාවක් සහ ශ්‍රී ලාංකික ඉන්දීය දෙමළ චිත්රපට 20 කට 'ශ්‍රී ලාංකික ඉන්දීය දෙමළ චිත්රපට 20 ක් පසුබිම් ගායකයෙකු ලෙස දැක්වේ. ඇය සිංහල ගීත 6000 කට වඩා සහ විවිධ භාෂා 9 ක ගීත 1000 කට වඩා ගායනා කළාය."
    }, 
    "7b6be8a8-29bd-4ab5-99b8-bf70966882b8": {
        "name": "ආනන්ද සමරකෝන්", 
        "genres": [], 
        "birth": 1911, 
        "summary": "එගොඩහගේ ජෝර්ජ් විල්ෆ්රඩ් අල්විස් සමරකෝන් (1911 ජනවාරි 13) 1962 අප්‍රියෙල් 2 අප්‍රේල් 19) ආනන්ද සමරකෝන් ලෙස හැඳින්වේ. ඔහු ශ්‍රී ලංකාවේ ජාතික ගීය 'නැටෝ නාමෝ මාතා' මෙහෙයවූ අතර නූතන ශ්‍රී ලාංකික ගේටා සාතියිගේ (ගීත සාහිත්යය) කලාත්මක සිංහල සංගීතය හා නිර්මාතෘගේ පියා ලෙස සැලකේ. ඔහු 1962 දී සියදිවි නසා ගත්තේය, සමහර විට සංයුතියක පද රචනයක අනවසර වෙනස්කම් මගින් ධාවනය විය හැක."
    }, 
    "13a57432-88e4-4c9b-91b9-abc6549a05c8": {
        "name": "සනත් නන්දසිරි", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1942, 
        "summary": "මහාචාර්ය සංගී වනාත් හේරත් මුදියන්ස්ලේජ් සනත් නන්දසිරි (1942 පෙබරවාරි 15 වන දින 15.42 පෙබරවාරි 15) සංගීතඥ සංගීත අධ්යක්ෂ, රචනා සහ පසුබිම් ගායකයෙකි. ඔහු ශ්‍රී ලංකාවේ දෘශ්ය හා ප්‍රසාංගික කලා විශ්ව විද්යාලයේ වත්මන් කුලපති වේ. ශ්‍රී ලංකා සංගීතයේ සුවිශේෂී ගායිකාවක් වන නන්දසිරි දශක හයකට වඩා වැඩි කාලයක් පුරා තම රචනාකරුවන් සඳහා සම්මාන කිහිපයක් ලැබී තිබේ. ඔහු සංගීතය රචනාමයිම් සඳමලිගිගේ රූකඩයිමා වෙත රචනා කළේය."
    }, 
    "7365b8e0-73b7-4e08-9945-aa81f4a7cc15": {
        "name": "දිනේෂ් සුබසිංහ", 
        "genres": [], 
        "birth": 1979, 
        "summary": "දිනේෂ් සුබසිංහ (1979 ජූලි 10 වන දින කොළඹ)) ශ්‍රී ලාංකික නිර්මාපකයෙකු, වයලීන කරුවෙකු සහ සංගීත නිෂ්පාදකවරයෙකි. ඔහු බෞද්ධ කථිකයන්, බෞද්ධ කථිකයන්, කෞනා නාදී රචනා කළ අතර, රාවනාතාහා නත්තල්යා ලෙස හැඳින්වෙන නැතිවූ පුරාණ සංගීත භාණ්ඩයක් නැවත හඳුන්වා දුන්නේය. ඔහු චිත්රපට හා රූපවාහිනී රචකයෙක් වන අතර, බටහිර හා නැගෙනහිර හා නැගෙනහිර සම්භාව්ය සංගීතය ඉලෙක්ට්රොනික සංගීතය, බෞද්ධ සංගීතය, ජන සංගීතය, සාම්ප්‍රදායික වාද්ය හා ලෝක සංගීත ප්‍රභේද සමඟ ඒකාබද්ධ කරන චිත්රපට සහ රූපවාහිනී රචකයෙකි. 2002 සිට 2009 දක්වා ඔහු පොප් සම්භාව්ය පටිය, ඩී ආර් විසින් ඩීඊඊ ආර්. සී. ඔහු චිත්රපට සම්මාන 10 ක් සඳහා නම් කර තිබේ "
    },
    "eaef330e-737f-499b-88e6-7aa1f6dd35aa": {
        "name": "ප්‍රියා සුරියසේන", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1952, 
        "summary": "එම්. එල්. ඩී. සමූහ ගායිකාවක් ලෙස තරුණ ගායනා කණ්ඩායමෙන් සූරියසේන මහතාට තම දක්ෂතා පෙන්වීමට හැකි වූ අතර ඇතා රන්වියනා, මටා රණජනා, අඩා ඩේවසේ සහ සුදු පැහැති පැරවි රේන."
    }, 
    "c06602a9-094b-4be4-8947-a1a02d058d51": {
        "name": "විජය කුමාරතුංග", 
        "genres": [], 
        "birth": 1945, 
        "summary": "කෝවිලේගේ ඇන්ටන් විජය කුමාරනාතුංග (1945 ඔක්තෝබර් 9 1945 පෙබරවාරි 16) විජය කුමාරතුංග ලෙස ජනප්‍රියයි. එය ශ්‍රී ලංකා සිනමා නළුවා, පසුබිම් ගායකයා සහ දේශපාලන ician යෙකි. ශ්‍රී ලංකාවේ සිනමාවේ වඩාත් ජනප්‍රිය අයිකන වලින් එකක් ලෙස සැලකේ. 1978 සිට 1978 සිට 1978 සිට ඔහු හිටපු ශ්‍රී ලංකා ජනාධිපති චන්ද්රිකා කුමාරනාතුංග සමඟ විවාහ විය. ඔහු ශ්‍රී ලංකා මහජානා පක්ෂයේ නිර්මාතෘවරයා විය."
    }, 
    "79ef360b-315d-4ea3-8e64-5f30327a94b0": {
        "name": "දුෂ්යන්ත් වීරමන්", 
        "genres": [], 
        "birth": 1980, 
        "summary": "දුෂ්යන්ත් වීරමන් යනු ශ්‍රී ලංකාව, සිංගර්, නර්තන ශිල්පියෙකු, නර්තන ශිල්පියෙකු, නර්තන ශිල්පියෙකු, නර්තන ශිල්පියෙකු වන අතර රියැලෑ දක්ෂතා ජයග්රාහකයා 2008 දී 'සිරසා නැටුම් තාරකා' පෙන්නුම් කරයි. ඔහු 2013 දී ශ්‍රී ලංකා සම්මානය ලැබූ කැපී පෙනෙන තරුණයින් 10 දෙනාගේ ජයග්රාහකයෙකි ශ්‍රී ලාංකික පොප් - යුගල, බතුඩියා සහ සන්තුෂ් වලින් අඩක් වන සන්තූෂ් දරාකරුගේ බාල සොහොයුරිය ද වේ "
    }, 
    "e4ab752a-d9e5-4b1d-958e-37bafd924203": {
        "name": "ලතා වල්පොල", 
        "genres": [], 
        "birth": 1934, 
        "summary": "ඇගේ වේදිකාවේ නම ලෙස වඩා හොඳින් දැන සිටි දේශමන්යා මාරිසෙජිනේජ් රිටා ජනනය ප්‍රනාන්දු, ලතා වල්පොල කැපී පෙනෙන ශ්‍රී ලාංකික වාචික කලාකරුවෙකි. පල්ලි ගායන ශිල්පියෙකුගේ සාමාජිකාවක් ලෙස ඇය ශ්‍රී ලංකාවේ ප්‍රමුඛතම ගායිකාවක් වන වල්පොල වෘත්තියක් ලබා ගත් බව පල්ලිය ගායනයකි. අද ඇගේ රසිකයන් බොහෝ විට ඇයව හඳුන්වන්නේ 'ශ්‍රී ලංකාවේ නයිටිං ගේ' ලෙසයි "
    },
    "0b432b1e-ca57-4936-a27f-0cba20d807ce": {
        "name": "නන්දා මාලිනී", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1943, 
        "summary": "නන්දා මාලිනී ලෙස ජනප්‍රිය මිරිහානා අරච්චිගේ නන්දා මාලිනී පෙරේරා (1943 අගෝස්තු 23) නන්දා මාලිනීව ජනප්‍රියයි. ශ්‍රී ලංකාවේ වඩාත්ම ප්‍රසිද්ධ හා ගෞරවනීය සහායක ගායිකාවක් වන මාලිනීගේ ගායන තේමාවන් තෝරා ගැනීම සැබෑ ජීවිත හා සමාජ-සංස්කෘතික තත්වයන් මත පදනම් වේ. ඇයගේ ගීත මානව යථාර්ථයන්ගෙන් මිදුණු සබඳතා, ජීවිත තත්වයන් සහ හැඟීම් පිළිබඳ සංකීර්ණ අදහස්."
    }, 
    "88022344-8f1e-4566-b995-1d57092856c5": {
        "name": "නාරද දිසාසේකර", 
        "genres": [], 
        "birth": 1933, 
        "summary": "නාරද දිසාසේකර (1933 මැයි 7 වන දින 2010 මැයි 2010) ශ්‍රී ලංකා සම්භාව්ය ගායකයෙකි. රන්මතු දූවා සඳහා තරුණ නන්දා මාලිනියෙකු සමඟ 1964 දී ගලන ගංගාකි තරුණියෙකු සමඟ 1964 දී ගනේවිය සම්මානය දිනාගත් පළමු ගායකයා ඔහු විය."
    }, 
    "522013d6-9abf-4afa-bb79-4fc867c023ea": {
        "name": "චන්ද්‍රලේඛා පෙරේරා", 
        "genres": ["pop"], 
        "birth": 1961, 
        "summary": "චන්ද්‍රලේඛා පෙරේරා (1961 දෙසැම්බර් 1 වන දින උපත ලැබීය), ජනප්‍රිය ශ්‍රී ලාංකික පොප් ගායකයෙකි."
    }, 
    "ad9d9f04-41b4-44f1-ae8f-bd7e9f41e689": {
        "name": "කීර්ති පැස්කුවෙල්", 
        "genres": [], 
        "birth": 1956, 
        "summary": "කීර්ති පැස්කුවෙල් මෙන්ම කීර්ති පැස්කුවෙල් ලෙස වෘත්තීමය වශයෙන් ප්‍රසිද්ධව සිටින පැස්කෙල් වසල් වසල් වලාම් ආනන්ද කීර්තිරත්න ශ්‍රී ලංකාවේ මහනුවර ප්‍රවීණ පොප් සංගීතඥයෙකු හා නිර්මාපකයෙකු වේ. ඔහු දශක තුනකට වැඩි කාලයක් තිස්සේ රඟපාමින් සම්මාන ගණනාවක් ජයගෙන තිබේ. කීර්ති ජාතික යථාර්ථය පිළිබඳ විනිසුරුවරයෙකු වන ඩෙරානා ඩේක් ස්ටාර්, 2008 සිට අද දක්වා යථාර්ථවාදී සංදර්ශනයක දී අඛණ්ඩව යුධමය ප්‍රදර්ශනයක අඛණ්ඩ කාල 10 ක් සඳහා පෙනී සිටීමට ශ්‍රී ලංකාවේ එකම විනිසුරුවරයා ලෙස වාර්තා වේ. ඔහු සංගීත අධ්යාපනයේ සහ සමාජ සුභසාධනයේ ක්රියාකාරීව කටයුතු කර ඇත."
    }, 
    "be0bdd2d-afa6-45a7-b584-a48841e17687": {
        "name": "චිත්රාල් සෝමපාල", 
        "genres": ["hard rock", "rhythm and blues", "heavy metal", "power metal"], 
        "birth": 1966, 
        "summary": "පෙරගස්වට් චන්දනා චිකාන චිත්රාල් සෝමපාල (1966 නොවැම්බර් 4 නොවැම්බර් 4), අකා චිටා සෝමපාල, ශ්‍රී ලංකාවේ දෘ harch රෙයේ හා බැර ලෝහ සහ බැර ලෝහ හ o නාශක සහ සංගීත අධ්යක්ෂකවරයෙකි. ඔහු යුරෝපීය බල ලෝහ පටි ෆයර්වොන්ඩ්, පවර් ගවේෂණය, ඇවලෝන්, ෆාරෝ, රතු පරිපථය සහ ශිෂ්ටාචාරය සමඟ ඔහුගේ වැඩ කටයුතු සඳහා ප්‍රසිද්ධය. 1998 දී නිකුත් කරන ලද ඔහුගේ සිංහල ලුහුබැඳ යාම හේතුවෙන් සෝමපාල සිය මව් රට තුළ ජනප්‍රියත්වයක් ලබා ගත්තේය."
    },
    "7b7d39b9-44a9-495b-b0e4-f9d00fb6c723": {
        "name": "නාලින් ජයවර්ධන", 
        "genres": [], 
        "birth": 1957, 
        "summary": "නාලින් ජයවර්ධන (සිංහල :) (1957 අප්‍රියෙල් 18) ජනප්‍රිය ශ්‍රී ලාංකික ගායක සහ වාචිකව. අන්තර්ජාලය තුළ අන්තර්ජාලය පදනම් කරගත් ශ්රව්ය ඇල්බුමක් මුදා හැරීමේ පළමු ශ්‍රී ලාංකික ගායකයා ඔහු වූ අතර, ලොව පුරා ලොව පුරා සිටින ඇල්බමයෙන් තොරව ඔහුගේ රසිකයන් ලබා ගැනීමට ඉඩ සලසන ලදී. මෙම ඇල්බමය නම් කළේ 2004 දී කන්ද පමුලේ ය. නලින් ජයවර්ධන 2004 දී ඕස්ට්රේලියාවේ පර්ත්හි වංචා කරයි. නලින් ජයවර්ධන මුල් ගීත 350 කට වඩා ගායනා කර ඇති අතර ඔහුගේ ගීතවල වීඩියෝ 20 කට අධික ප්‍රමාණයක් අන්තර්ජාලය හරහා ලබා ගත හැකිය. නාලින් ගේ ගීත බොහොමයක් ලියන ලද දක්ෂ සිංහල පද රචනා පෙරේරා වැනි දක්ෂ සිංහල පද රචනා කරන ලද ආචාර්ය වික්රමයා පෙරේරා වැනි දක්ෂ සිංහල පද රචකයින් සමඟ එක්ව මෙම ගීත රචනා කරන ලදී. නාලින්ගේ ගීත සඳහා සංගීත සංයුතිය නාලින් මෙන්ඩිස්, ජයංග ඩෙඩිගා නාලින් යනු ගූගල් ප්ලේ, අයිටියුන්ස් සහ ඇමේසන් යන ගීතවල තම ගීත මුදා හැරීමේ මුල් ශ්‍රී ලාංකික කලාකරුවෙකි. නලින් ජයවර්ධන විසින් ගායනා කරන ලද ගීත 300 කට අධික ප්‍රමාණයක් අඩංගු පද රචනා පොතක්, 'ගී තාරු මල්' රචනා පොතක් නිකුත් කරන ලදී. ඕස්ට්රේලියාවේ සෙරෙන්ඩිබ් ප්‍රකාශන 2016 දී, ඕස්ට්රේලියාවේ බහු සංස්කෘතික දේශගිෆිමානි සම්මානය 196 දී නලින් ජයවර්ධන මහතා ද, පූජ්ය බෙරුවෙලා සිබිතා සොබිතා සහ ආචාර්ය ගිල් ගිල් ගිල් පෙදෙසක් සෑදීම සඳහා ද සහයෝගයෙන් කටයුතු කර තිබේ. ශ්‍රී ලංකාවේ සුනාමි විපතට පත්වූවන්ගේ ආධාරයේ පුණ්යාධාර සීඩී ඩීවීඩී සෑදීම සඳහා ඔහු සහයෝගයෙන් කටයුතු කළේය. පළමුවන සිංහල ශ්රව්ය ප්‍රබන්ධ පොතේ කුලජෙයින් කුලෙගියාටා විසින් සංයුක්ත තැටි පහක් දක්වා විහිදෙන ඔහු රූග්රියා පෙරේරා සහ භද්රාජි මහින්ද ජයතිලක සමඟ සහයෝගයෙන් කටයුතු කළේය. මෙම ශ්රව්ය පොත යනු ලංකා උරුමය සහ සරසවි ප්‍රකාශකයන් වන ශ්‍රී ලංකාවේ නිෂ්පාදනයකි."
    }, 
    "45df71db-1eed-4cdb-9a4d-8f6c76d10939": {
        "name": "සෂිකා නිසංසලා", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1981, 
        "summary": "(1981 සැප්තැම්බර් 28) උපත ලැබූ සෂිකා නිසංසලා ජයසුමන ශ්‍රී ලංකා ගීත රංගන ශිල්පීන්ගේ සහ පසුබිම් ගායකයෙකි. 2016 සිට අඛණ්ඩව වසර හයක් තිස්සේ අඛණ්ඩව වාර්තා වී ඇත්තේ වඩාත් ජනප්‍රිය කාන්තා ගායිකාවක් වෙනුවෙන් ඇය සිහින්-නීල්සන් මහජන සම්මාන දිනා ගත්තාය."
    }, 
    "01b7c5e7-e434-4316-bad6-ada0840d4ee9": {
        "name": "ඇන්ටන් ජෝන්ස්", 
        "genres": ["baila"], 
        "birth": 1937, 
        "summary": "ඇන්ටන් ජෝන්ස් (1937 පෙබරවාරි 21 පෙබරවාරි 21) ශ්‍රී ලාංකික ගායිකාවක් සහ ගීත රචකයෙකු විය. ශ්‍රී ලංකාවේ ප්‍රමුඛ බාය අමිහිරි ගායකයෙකු ලෙස සැලකෙන ජෝන්ස් කුඩා දම්බුමා සහ උයලා පහාලා ඇතුළු පහර කිහිපයක් තිබුණි. [2] ඔහුගේ ගීත මේ රටේ සිදු වූ විශේෂ සිදුවීම් පිළිබඳව රචනා කර ඇති අතර, එමඟින් සැබෑ සිදුවීම් වලින් ගායනා කළ එකම ගායකයා බවට පත්විය."
    }, 
    "3b7d268c-692d-43de-9f54-4fdd6363aa47": {
        "name": "සී. ටී. ප්‍රනාන්දු", 
        "genres": ["pop", "soul", "rhythm and blues"], 
        "birth": 1921, 
        "summary": "සිරිල් ටියුඩර් ප්‍රනාන්දු (1921 ඔක්තෝබර් 17 1977 ඔක්තෝබර් 28), සී.ටී. ප්‍රනාන්දු ශ්‍රී ලංකා ගායිකාවක් සහ රචනාකරුවෙකු වූ බව ප්‍රනාන්දු. ශ්‍රී ලංකාවේ පළමු පොප් ගායකයා ලෙස හැඳින්වෙන ශ්‍රී ලාංකික සංගීතයේ වඩාත් ජනප්‍රිය ගායිකාවක් වන ප්‍රනාන්දු මහතා 'වනා බිල්ඉන්' 'සහ රෝසා පිරිමින් වැනි ඔහුගේ ගීතවල තේමාවන් සහ ඔහුගේ ගීතවල විවේචකයින්ට ප්‍රශංසා කරන ලදී. ' ඔහුගේ අනෙකුත් ජනප්‍රිය ගීත අතරට 'ලෝඩා නින්දේ', 'ගිල් පිරිමි තාරාවා' සහ 'මාරියා මාවු කුසයෙන්' ඇතුළත් වේ."
    }, 
    "7cc65a6a-712f-4bb0-9e09-7a8587eecb2c": {
        "name": "නිරෝෂා විරාජිනි", 
        "genres": [], 
        "birth": 1973, 
        "summary": "නිරෝෂා ධජජිනි ලෙසද හැඳින්වෙන විරාජිනි ලලිිති ද සිල්වා ශ්‍රී ලංකාවේ වසර 23 කට වැඩි කාලයක් පුරා පැවති වෘත්තියක් සහිතව ශ්‍රී ලංකාවේ ශ්‍රී ලාංකික සම්මානලාභී ගායකයෙකි."
    }, 
    "1b5ee669-541a-4e6a-bdaf-6610bb40460f": {
        "name": "ලයනල් රන්වල", 
        "genres": [], 
        "birth": 1939, 
        "summary": "ලයනල් රන්වල, (1939 නොවැම්බර් 13 නොවැම්බර් 13 නොවැම්බර් 13) ශ්‍රී ලංකාවේ සංගීතඥයෙකු සහ ගායිකාවක් සහ ශ්‍රී ලාංකික ජන සංගීතයේ පුරාවෘත්තයක් විය. ඔහුගේ උපන් නගරය කළුබොවිල සහ ඔහු කොළඹ කුමාර විද්යාලයේ වෙල්ලවත්ත සහ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බින් විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලය සහ කොළඹ ලුම්බිනි විද්යාලයත් වූ කළුබොවිල බුධගෝෂ විද්යාලයේ අධ්යාපනය ලැබීය."
    }, 
    "bccb7ee3-7242-452d-abf7-bb6fe36fb5e3": {
        "name": "ආත්මා ලියනගේ", 
        "genres": [], 
        "birth": null, 
        "summary": "ආත්මා ලියානගේ යනු ශ්‍රී ලාංකික ගායකයෙක් සහ ගීත රචකයෙකි. 90 දශකයේ මුල් භාගයේදී ඔහු 'ලියිතැම්බර' යන ගීතය සමඟ ජනප්‍රිය විය. ඔහු සිය නව ගීත සමඟ ජනප්‍රියත්වය ලබා ගත්තේ ඔහුගේ නව ගීත සමඟ 'අයීමත් ආඩරන්' සහ 'සීතා දූරා හන්ඩා' 'යන්නයි."
    }, 
    "15b8afae-9462-4080-8be1-aa94a5bb7b85": {
        "name": "ඇලන් රත්නායක", 
        "genres": [], 
        "birth": null, 
        "summary": "ඇලන් රත්නායක මුල් ශ්‍රී ලාංකික ගායක ගායිකාවක් හා සංගීතඥයෙකි. එච්එම්වී සහ කොලොම්බියාව සහ ගුණපාල පෙරේරා වැනි විවිධ වාර්තා ලේබල් සඳහා රත්නායක ගායනා කළේ ගුණපාල පෙරේරා වැනි අනෙකුත් ප්‍රසිද්ධ කලාකරුවන් අතර ලංකාවේ නම සඳහන් කරමිනි. රත්නායක බොහෝ සිංහල ග්රැමෆෝන් වාර්තා සඳහා ඔහුගේ හ voice ලබා දී තිබේ. 'ජෙතවානාරාම අත්වි රාමනි' යනු ඔහුගේ සංගීත ඇල්බම වලින් එකකි. 'ඇනෝමා ගන්යා', 'ජෙතවානාරාම අත්වි රාමනි' යනු ඇලන් රත්නායකගේ ප්‍රසිද්ධ ගීත දෙකකි."
    }, 
    "3a9e0e6a-1b10-485c-b709-4ef521868f2d": {
        "name": "ප්‍රදීප් රංගන", 
        "genres": [], 
        "birth": 1983, 
        "summary": "ප්‍රදීප් රංගන - (1983 නොවැම්බර් 12), ශ්‍රී ලංකා වෛද්යවරයෙක්, සිංගර් සහ ගීත රචකයෙකු. ඇමරිකානු පිළිමයට සමාන ශ්‍රී ලංකාවේ පිළිම වැඩසටහනක් වන සිරාසා සුපර්ස්ටාර් දෙවන කන්නයේ දී ඔහු ජයග්රාහකයා විය. ඔහු මේ වන විට බලන්ගෝඩා හි මාරතහන්න ප්‍රාදේශීය රෝහලේ වෛද්යවරියක් ලෙස සේවය කරයි."
    }, 
    "b58f61b5-8136-4987-a762-2bf9ef7479e2": {
        "name": "දසුන් මධුෂාන්", 
        "genres": [], 
        "birth": 1996, 
        "summary": "දසුන් මධුෂාන් (උපත 1996 පෙබරවාරි 2) ශ්‍රී ලාංකික ගායකයෙකි. ඔහු සිරාසා සුපර්ස්ටාර්ගේ පස්වන සමයේ ජයග්රාහකයා වේ."
    }, 
    "0ccb751b-88d9-44c8-b252-a80832f200bc": {
        "name": "මාරියාසෙල් ගුණතිලක", 
        "genres": [], 
        "birth": 11, 
        "summary": "මාරියාසෙල් ගුණතිලක යනු ශ්‍රී ලාංකික ගායකයෙක් සහ සංගීතඥයෙකි. ඇය ශ්‍රී ලංකාවේ පමණක් නොව එක්සත් රාජධානිය, එක්සත් රාජධානිය, එක්සත් රාජධානිය, එක්සත් අරාබි එමීර් රාජ්යය, සිංගප්පූරුව සහ ඕස්ට්රේලියාව යන රටවල ද සිදු කර ඇත."
    }, 
    "fcadccbc-17e3-44b6-b2fb-c45e5b56c20b": {
        "name": "රොඩ්නි වර්නකුල", 
        "genres": [], 
        "birth": 1961, 
        "summary": "වර්නකුල පැටබැන්ඩිගේ රොඩ්නානි ප්‍රියන්ත පෙරේරා, රොඩ්නි වර්නකුල ලෙස ජනප්‍රිය වූ (1961 අප්‍රියෙල් 24 අප්‍රියෙල්) [සිංහල]) ශ්‍රී ලාංකික වර්නකුල ලෙස ජනප්‍රියයි."
    },
    "3754589a-3e5d-4e38-ac14-c38878e952e4": {
        "name": "එච්. ආර්. ජෝතිපාල", 
        "genres": [], 
        "birth": 1936, 
        "summary": "හෙට්ටියාරාචිගේ රෙජිනෝල්ඩ් ජිනෝල්ඩ් ජෝතිපාල (1936 ජූලි 12), 1986 ජූලි 12), එච්. ආර්. ජෝතිපාල ලෙස සිංහල සිනමාවේ ශ්‍රී ලංකා පසුබිම් ගායකයා මෙන්ම සිනමා නළුවෙකු ද විය. ශ්‍රී ලංකා චිත්රපට ඉතිහාසයේ හොඳම පසුබිම් ගායිකාව ලෙස ජෝතිපාල ඔහුගේ හ voice එඩි ජයමාන් සිට රන්ජන් රාමනායක දක්වා දිවුරුම් දුන්හ. ඔහු ඔපෙරා ගායකයෙකු ලෙස ද සේවය කළේය. ඔහු 1987 ජූලි මාසයේදී වයස අවුරුදු 51 දී හෘද අත්අඩංගුවට ගැනීමෙන් මිය ගියේය."
    }, 
    "379db4f5-41a6-434e-83ea-c9c618fc54a9": {
        "name": "නිමල් මෙන්ඩිස්", 
        "genres": [], 
        "birth": 1934, 
        "summary": "නිමල් මෙන්ඩිස් (19342015) ශ්‍රී ලාංකික ගායිකාවක් සහ ගීත රචකයෙකු වූ අතර එය පොප්ස් හි බීබීසී රූපවාහිනී වැඩසටහනේ පෙනී සිටීමට ශ්‍රී ලංකා සංගීතඥ යින් අතළොස්සක් විය (1968). මෙන්ඩිස් රංගනගත අයිතිවාසිකම් සමිතියේ දීර් standing කාලීන සාමාජිකයෙකු වූ අතර මහා බ්රිතාන්යයේ යාන්ත්රික ප්‍රකාශන හිමිකම් ආරක්ෂණ සංගමය 1950 දශකයේ අගභාගයේදී, යුගයේ දකුණු ආසියාවේ ගුවන් හමුදාව විසින් ගුවන්විදුලි සිලෝන් විසින් 1950 දශකය තුළ සොයා ගන්නා ලදී. 'කැන්ඩින් එක්ස්ප්‍රස්' ඇතුළුව, දකුණු ආසියාවේ 'කැන්ඩියන් එක්ස්ප්‍රස්' ඇතුළුව මුල සිටම මෙන්ඩිස්ගේ ගීත මෙම ස්ථානය විසින් දකුණු ආසියාවේ 'කැන්ඩියන් එක්ස්ප්‍රස්' හි පිටුබලය දරාගෙන ඔහුගේ ගීත ඉල්ලා සිටි ෂුවෝඩ් සිලෝන් හි ය. ඔහුගේ කුඩා කල සිටම සංගීතය සමඟින්, ලන්ඩනයේ වසර ගණනාවක් ලන්ඩනයේ වාසය කර ඇති අතර බොහෝ විට ශ්‍රී ලංකාවට පැමිණ තිබේ. ඔහු ලෙපායිස් හි ලෙපායිස් හි ප්‍රංශයේ නිරිත දෙසින් පිහිටි මුලසුන දැරුවේ අවුරුදු පහක් ඔහුගේ බිරිඳ රන්ජානි සමඟ ය. මෙන්ඩිස් 2010 දී මිය යන තුරුම වසර 33 ක් පුරා රන්සානි සමඟ විවාහ වී ඇති අතර, මේන්ඩාස් ඩිමීස් ප්‍රභවයන් සමඟ 2004 දී පද්මරමි, සුනාමියෙන් පෙලෙනිස් විසින්, වින්දිතයින්ට ආධාර කිරීම සඳහා ගීතයක් රචනා කිරීමට පෙලඹුණි. පාර්ලිමේන්තු මන්ත්රී ලින්ඩා පර්හැම්ගේ අනුග්රහය දක්වන 638 වන දින ඕස්ට්රේලියාව, ශ්‍රී ලංකාව සහ එක්සත් රාජධානියේ මෙය වාර්තා වී ඇති අතර එය 2016 ලකුණු කාල පරිච්ෙඡ්දය තුළ බ්රිතාන්ය පාර්ලිමේන්තුව විසින් පැසසුමට ලක් කරන ලදී."
    },
    "3eb6b934-6f0b-47d2-a1d1-6580a4155e07": {
        "name": "පෝල් ප්‍රනාන්දු", 
        "genres": ["pop", "calypso", "r&b", "baila"], 
        "birth": 1951, 
        "summary": "මදවේල හෙවගේ පෝල් පෝල් ප්‍රනාන්දු (1951 නොවැම්බර් 24 නොවැම්බර් 24, 16 නොවැම්බර් බොහෝ විට 'බයිලා කුමරු' ලෙස හැඳින්වෙන ප්‍රනාන්දු ශ්‍රී ලංකාවේ බටහිර සංගීත ක්ෂේත්රයේ වඩාත් ජනප්‍රිය ගායිකාවක් බවට පත්විය. එසේම ඔහු ශ්‍රී ලංකාවේ බයිල් කලාව ජනප්‍රිය කිරීම සඳහා කැප වූ ප්‍රමුඛතම කලාකරුවන්ගෙන් කෙනෙකි."
    },
    "b0182184-cb60-4b1e-b3d4-4dae7a266b9f": {
        "name": "රුක්මානි දේවි", 
        "genres": [], 
        "birth": 1923, 
        "summary": "එපි. ඇය එය වේදිකාවෙන් රිදී තිරයට ගෙන, ඇය මිය යන විට චිත්රපට 100 කට ආසන්නයේ රඟපෑවාය. ගායනය සඳහා සමාන ආශාවක් තිබීම මෙන්ම තනු කල්පිත හ voice ක්ද, ඇය ග්රැමෆෝන් යුගයේ ශ්‍රී ලංකාවේ ප්‍රමුඛතම ගායිකාවයි. ඇගේ මරණයෙන් පසු, 1979 සරසවිය සම්මාන උළෙලේදී ඇයට සරසවිය 'රං තිසර' - ජීවිත කාලය පුරාම සම්මානය පිරිනමන ලදී."
    }, 
    "5ab4ee2b-6dfb-4e6f-8757-fda3852887ae": {
        "name": "කමල් අද්දරආරච්චි", 
        "genres": [], 
        "birth": 1962, 
        "summary": "කමල් අද්දරාරච්චි 1962 පෙබරවාරි 5වන දින අද්දරාරච්චිගේ ගුනේන්ද්‍ර කමල් ලෙස උපත ලැබුවේය. ඔහු සම්මානලාභී ශ්‍රි ලාංකික සිනමා සහ ටෙලිනාට්‍ය නළුවෙකු, ගායකයකු සහ වැඩසටහන් ඉදිරිපත් කරන්නකු ද වන්නේය. ඔහු ගේ ප්‍රථම රංගනය එළිදැක්වූයේ 1981 වර්ෂයේ දී නිපද වූ ගාමිණි ෆොන්සේකා මහතාගේ “සාගරයක් මැද” චිත්‍රපටයෙනි. එවිට ඔහු පාසැල් ශිෂ්‍යයෙකි. 1970 අග භාගයේ සිට ඔහු චිත්‍රපට හා ටෙලි නාට්‍ය බොහොමයක විවිධාකාර චරිතයන් ඔස්සේ පෙනී සිටියේය. වර්තමානය වන විට චිත්‍රපට 40 කට ,ටෙලිනාටය 20කට හා වේදිකා නාට්‍ය 6 කට වැඩි ප්‍රමාණයක සිය රංගනයෙන් දායක වී ඇත. 2002 වර්ෂයේ දී “අග්නිදාහය” චිත්‍රපටයේ ඉදිරිපත් කළ සොබනාගේ චරිතය වෙනුවෙන් හොඳම නළුවා සඳහා වූ සරසවි සම්මානය දිනා ගත්තේය. 1993 වර්ෂයේදී “සප්ත කන්‍යා” චිත්‍රපටය සඳහා දමයන්ති ජයසූරිය සමග ගැයූ “උන්මාදවූ “ නම් යුග ගීතයත් සමග කමල් අද්දරාරච්චි ගායකයකු ලෙස සිය නම සනිටුහන් කළේය. එමෙන්ම ඔහු “රියැලිටි” වැඩසටහනක් වන “සිරස සුපර්ස්ටාර්” තරඟයේ වැඩසටහන් ඉදිරිපත් කරන්නා ලෙසද කටයුතු කළේය."
    },
    "c84fa056-0126-416b-a58e-8096225b7606": {
        "name": "රුක්ෂන් පෙරේරා", 
        "genres": [], 
        "birth": 1956, 
        "summary": "රුක්ෂන් පෙරේරා, ශ්‍රී ලාංකික සායනා කරන්නෙකු වන සිංගර්-ගීත රචකයෙකි, වාර්තාගත නිෂ්පාදක, ජාත්යන්තර පටිගත කිරීම, රූපවාහිනී තරුව සහ බහු පෙළක්."
    }, 
    "cb4c4897-a9aa-4846-a52f-07dc0a0440ae": {
        "name": "සහන් රන්වල", 
        "genres": [], 
        "birth": 1978, 
        "summary": "සහන් රන්වල (1978 ජූලි 3 වන දින [සිංහල] ලෙස) ශ්‍රී ලංකා සිනමාවේ නළුවෙකු, වේදිකා නාට්ය හා රූපවාහිනියේ නළුවෙකි. ඔහු සංගීතඥයෙක්, රචනාකරුවෙකු සහ ඉදිරිපත් කරන්නෙකු ලෙස ද කටයුතු කරයි. ඔහු ලයනල් රන්වල ජන කලා පදනමේ කළමනාකාර අධ්යක්ෂවරයා වේ."
    }, 
    "2a908705-41df-4aeb-b106-111df7dcd9a6": {
        "name": "යොහානි", 
        "genres": [], 
        "birth": 1993, 
        "summary": "යොහානි නමින් ජනප්‍රිය වූ යොහානි දිලෝකා ද සිල්වා යනු ශ්‍රී ලාංකික ගායිකාවක්, ගීත රචකයෙක්, රැප් ගායකයෙක්, සංගීත නිෂ්පාදකයෙක් සහ යූ ටියුබර් ය. ඇය TikTok හි ද ප්‍රසිද්ධියක් උසුලන අතර සංගීත භාණ්ඩ ආනයනය සහ අපනයනය පිළිබඳ ව්‍යාපාරික කාන්තාවකි. ඇය සිය සංගීත දිවිය ආරම්භ කළේ යූ ටියුබ්කරුවෙකු ලෙසය."
    }, 
    "ddc08e84-2133-469b-ba0c-dc19e6faee13": {
        "name": "වික්ටර් රත්නායක", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1942, 
        "summary": "රත්නායක අරච්චිලේගේ වික්ටර් (උපත 1942 පෙබරවාරි 18), වික්ටර් රත්නායක ලෙස ජනප්‍රිය, ශ්‍රී ලාංකික ගායක, රචනා, ගීත රචනා සහ කීර්තිමත් සංගීතඥයෙකි. ඒකල ප්‍රසංගයක් පැවැත්වූ පළමු ශ්‍රී ලාංකික කලාකරුවා ඔහු ය; ඔහුගේ ප්‍රසංගය 'එස්' ලෙස හැඳින්වූයේ 1973 දී ප්‍රථම වරට සිදු වූ අතර එය ක්ෂණික සාර්ථකත්වයක්. ඔහුගේ සාර්ථකත්වයේ සාර්ථකත්වය රත්නායකගේ සාර්ථකත්වයට භාරදෙන්නේ තමාගේ 'රංගදාරි සම්භාව්ය සංගීතය සමඟ බටහිර සංගීතයේ එක් මිශ්රණයක්' යන්නයි. ඔහුගේ ගීත ප්‍රේමයෙන් හා බුද්ධාගමට වෙනස් වන විවිධාකාර තේමාවන් සමඟ කටයුතු කරයි. රත්නායක, සිරිබෝ අයියා, පොඩි මල්ලී, සාරංගි, හුලවාලි සහ අතුරු මිතුරුසු වැනි චිත්රපට සඳහා සංගීතය රචනා කර තිබේ."
    }, 
    "91ac3450-c8ad-44be-8b61-7d12784b8e43": {
        "name": "උමාරියා සිංවන්ස", 
        "genres": ["pop", "r&b", "jazz"], 
        "birth": 1991, 
        "summary": "උමාරියා බින්ති අයේෂා සිංහවංශ (උපත 1991 ජනවාරි 5), උමාරියා සිංහවංශ ලෙස ජනප්‍රිය, ශ්‍රී ලාංකික පොප්, ආර් ඇන්ඩ් බී සහ ජෑස් ගායිකාවකි. ඇය ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවෙන් මෙතෙක් උසස් ශ්‍රේණියක් පිරිනමා ඇති ලාබාලතම සංගීතවේදිනියයි. ශ්‍රී ලංකාවේ කොළඹ උපන් උමාරියා 2005 දී වයස අවුරුදු 11 දී සිය සොයුරිය සමඟ විවිධ අවස්‌ථාවලදී සිය සංගීත දිවිය ආරම්භ කළාය. ඇය ප්‍රථම වරට පසුබිම් ගායිකාවක් ලෙස රංගනයට පිවිසියේ ආසයි මං පියාඹන්න චිත්‍රපටියෙනි. එසේම ඇය පෑන් ඒෂියා මියුසික් ජාත්‍යන්තර සංගීත තරඟයේදී සහ ක්‍රිමියා මියුසික් ෆෙස්ට් ජාත්‍යන්තර තරඟයේදී රිදී සම්මාන දිනා ගත්තාය."
    }, 
    "cf9f686f-2779-4496-a2d1-95ddef3380da": {
        "name": "ඉන්ද්‍රානි පෙරේරා", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 15, 
        "summary": "ඉන්ද්‍රානි පෙරේරා (පෙබරවාරි 15 වන දින උපත ලැබූ ශ්‍රී ලාංකික සිංගර් සහ පසුබිම් ගායකයෙකි. ඉන්ද්‍රානි සහ ක්ලැරන්ස් විජේවර්ධන සහ ඇනස්ලි මැලේවානා සමඟ 'මුල් සිංහල පොප් ට්ටියෝ' ලෙස හැඳින්වේ."
    }, 
    "2e087ab4-fa16-4acf-983b-81508e482d8a": {
        "name": "රූකාන්ත ගුණතිලකේ", 
        "genres": [], 
        "birth": 1959, 
        "summary": "මාරියෝ ග්ලෝරි රූකන්ත රූකන්ත ගූනාතිලකේ (1959 සැප්තැම්බර් 5 සැප්තැම්බර් 5), ශ්‍රී ලාංකික ගායකයෙක්, සංගීතඥයෙකු හා ගීත රචකයෙකු. ශ්‍රී ලංකාවේ වඩාත්ම බලගතු සංගීත කලාකරුවන්ගෙන් එක් අයෙකු වන රූකාන්ත 1980 දශකයේ අග භාගයේ නවක ගායිකාවක් ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කළේය. ඔහු නිතරම තම බිරිඳ චන්ද්රලේඛ පෙරේරා සමඟ යුගල සිදු කරයි. ඔහුගේ දියණියන් වැසි චරතු සහ සුළං චිත්රපටය ගායිකාවන් දෙදෙනාම වේ .රොකාන්ත යන දෙදෙනාම ශ්‍රී ලංකාවේ පොප් සහ හිතාමතාම කර්මාන්තයේ වඩාත්ම සාර්ථක සංගීතඥයෙකි. ඔහු ශ්‍රී ලාංකිකයන් අතර පොප්හි රජු ලෙස හැඳින්වේ. ඔහුගේ ඇල්බම ශ්‍රී ලංකාවේ පිටපත් 15,000 ක් පමණ විකුණා ඇත. ඔහු 1980 ගණන්වල ඔහුගේ ගීත සමඟ ශ්‍රී ලංකා සංගීත ක්ෂේත්රය වෙනස් කළ පුද්ගලයා ලෙස හැඳින්වේ."
    },
    "a250bc0b-67ac-42b6-b620-8973fd6b6c20": {
        "name": "ජගත් වික්‍රමසිංහ", 
        "genres": ["pop", "soul", "rhythm and blues", "indian classical music"], 
        "birth": 1966, 
        "summary": "ජගත් වික්‍රමසිංහ (1966 අප්‍රියෙල් 10 අප්‍රේල් 10) ශ්‍රී ලංකා සංගීතඥයෙකි. ඔහු ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාවේ වත්මන් සභාපතිවරයා වේ. ඩික්රාමසිංහ ඉංජිනේරුවරයෙකු ලෙස වෘත්තියක් කළ නමුත් පසුව ඔහුගේ දෙමාපියන් මෙන් සංගීතඥයෙකු වීමට තීරණය කළේය. ඔහුගේ ගේ සේවය ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවට අයත් ස්ථානවල සිය ගීත වාදනය කිරීමෙන් පසුවය. ඔහු 1 සිට 3 වන කන්නය සඳහා සිරසා සුපර්ස්තාර් හි පළමු විනිසුරුවන් තිදෙනාගෙන් කෙනෙකි."
    }, 
    "ac854483-b131-438a-9879-8a1afc7860df": {
        "name": "ස්ටැන්ලි පීරිස්", 
        "genres": [], 
        "birth": 1941, 
        "summary": "ස්ටැන්ලි පීරිස් (1941 ඔක්තෝබර් 12 දින 2002 ඔක්තෝබර් 13) ශ්‍රී ලාංකික සංගීතඥයෙකු හා සංගීත නිර්මාපකයෙකු විය."
    }, 
    "5dcef76e-2ea6-4e58-8802-08003cd9c2fc": {
        "name": "මොහිදීන් බෙග්", 
        "genres": ["soul", "indian classical music"], 
        "birth": 1919, 
        "summary": "කලා සර්රි අල්හාජ් මනදවරු මොහිදීන් බෙග් (1919 දෙසැම්බර් 5 - 1991 නොවැම්බර් 4), ජනප්‍රියව, මොහයිඩන් බේ.අයි.එල්. ශ්‍රී ලංකා සංගීතඥයෙකි. සිංහල සංගීතයේ වඩාත්ම බලගතු ගායකයෙක්, බෙග් විශේෂයෙන් ඔහුගේ බෞද්ධ භක්තිය සංගීතය සඳහා ප්‍රසිද්ධය. ඔහු තමිල්නාඩුවේ සාලෙම් සිට සාලෙම්හි සිට හිණියෙල්රාබාඩි මුස්ලිම් සම්භවයක් ඇති මුස්ලිම්වරයෙකි. ඔහු රටේ කලා ඉතිහාසයේ ඉතා බලගතු බහු සංස්කෘතික චරිතයක් ලෙස සැලකේ. බෙග් යනු ශ්‍රී ලංකාවේ පළමු සම්මානලාභී පුරවැසියෙකි."
    }
}
